In [1]:
import pandas as pd
import numpy as np

In [2]:
# 聚合
sales = [{'account': 'Jones LLC','type':'a', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co','type':'b',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc','type':'a',  'Jan': 50,  'Feb': 90,  'Mar': 95 },
         ]
df = pd.DataFrame(sales)
df

     account type  Jan  Feb  Mar
0  Jones LLC    a  150  200  140
1   Alpha Co    b  200  210  215
2   Blue Inc    a   50   90   95

In [3]:
# generic.DataFrameGroupBy object
# 按 type 分组
df.groupby('type')

In [4]:
df.groupby('type').groups

{'a': [0, 2], 'b': [1]}

In [5]:
for a, b in df.groupby('type'):
    print(a)
    print(b)

a
     account type  Jan  Feb  Mar
0  Jones LLC    a  150  200  140
2   Blue Inc    a   50   90   95
b
    account type  Jan  Feb  Mar
1  Alpha Co    b  200  210  215

In [6]:
# 聚合后进行统计
df.groupby('type').count()

      account  Jan  Feb  Mar
type
a           2    2    2    2
b           1    1    1    1

In [7]:
# aggregate 合计，后面写几个字段，结构就有几个属性。
df.groupby('type').aggregate({'type': 'count', 'Feb': 'sum'})

      type  Feb
type
a        2  290
b        1  210

In [9]:
group = ['x', 'y', 'z']
data = pd.DataFrame({
    'group': [group[x] for x in np.random.randint(0, len(group), 10)],
    'salary': np.random.randint(5, 50, 10),
    'age': np.random.randint(15, 50, 10),
})
data

  group  salary  age
0     x      27   37
1     x       5   16
2     z      46   41
3     z       7   36
4     z      13   24
5     z      18   46
6     z      28   43
7     x      49   16
8     x       6   22
9     y      48   15

In [10]:
data.groupby('group').agg('mean')

       salary    age
group
x       21.75  22.75
y       48.00  15.00
z       22.40  38.00

In [11]:
# 聚合之后，然后平均，与上一句结果相同
data.groupby('group').mean()

       salary    age
group
x       21.75  22.75
y       48.00  15.00
z       22.40  38.00

In [13]:
data.groupby('group').mean().to_dict()

{'salary': {'x': 21.75, 'y': 48.0, 'z': 22.4},
 'age': {'x': 22.75, 'y': 15.0, 'z': 38.0}}

In [15]:
# 是在原来的数据位置更新结果，跟上面的有很大不同
data.groupby('group').transform('mean')

   salary    age
0   21.75  22.75
1   21.75  22.75
2   22.40  38.00
3   22.40  38.00
4   22.40  38.00
5   22.40  38.00
6   22.40  38.00
7   21.75  22.75
8   21.75  22.75
9   48.00  15.00

In [25]:
# 数据透视表
pd.pivot_table(data, values='salary', columns='group',
               index='age', aggfunc=np.count_nonzero, margins=True
               )

group    x    y    z  All
age
15     NaN  1.0  NaN    1
16     2.0  NaN  NaN    2
22     1.0  NaN  NaN    1
24     NaN  NaN  1.0    1
36     NaN  NaN  1.0    1
37     1.0  NaN  NaN    1
41     NaN  NaN  1.0    1
43     NaN  NaN  1.0    1
46     NaN  NaN  1.0    1
All    4.0  1.0  5.0   10

In [26]:
pd.pivot_table(data, values='salary', columns='group',
               index='age', aggfunc=np.count_nonzero, margins=True
               ).reset_index()

group  age    x    y    z  All
0       15  NaN  1.0  NaN    1
1       16  2.0  NaN  NaN    2
2       22  1.0  NaN  NaN    1
3       24  NaN  NaN  1.0    1
4       36  NaN  NaN  1.0    1
5       37  1.0  NaN  NaN    1
6       41  NaN  NaN  1.0    1
7       43  NaN  NaN  1.0    1
8       46  NaN  NaN  1.0    1
9      All  4.0  1.0  5.0   10